test_uz = {
    "Farzandingiz bo’sh vaqtida nimalar bilan shug’ullanadi?": {
        "Kompyuterda yoki qo’lda chizish✏️": "Dizayn",
        "Telefonda o’yinlar o’ynash va ilovalardan foydalanish📱": "Backend",
        "Yuqorida sanab o’tilganlar barchasi": "Frontend"
    },
    "Farzandingiz qaysi fanlarni yaxshiroq o’zlashtiradi?📔": {
        "Matematika, fizika, ingliz tili🧮": "Backend",
        "Rasm chizish, mexnat, jismoniy tarbiya✏️": "Dizayn",
        "Ona tili, adabiyot, san’at📝": "Frontend"
    },
    "Farzandingiz biror vazifaga qanday yondashadi?": {
        "Ijodiy, o’zgartirish kiritishni yoqtiradi🧚🏻‍♀️": "Dizayn",
        "Masalani boshidan tushunib olib, qadam-baqadam yechim topadi🧑🏻‍🏫": "Frontend",
        "Internetdan ma’lumot izlaydi va yechim topadi🧑🏼‍💻": "Backend",
        "Barcha javoblar to’g’ri✔️": "Fullstack"
    },
    "Farzandingiz uchun eng xursand qiluvchi sovg’a?🎁": {
        "Chizish va bo’yash uchun to’plam🖌️": "Dizayn",
        "Miyani charxlovchi o’yinlar to’plami🔗": "Frontend",
        "Kompyuter yoki unga aloqador texnika💻": "Backend",
        "Telefon va uning qo’shimcha jihozlari📱": "Fullstack"
    },
    "Farzandingiz kayfiyati yo’q vaqtda qanday o’ziga keladi?😔": {
        "Kompyuter o’ynab👨🏽‍💻": "Backend",
        "Tabiat qo’ynida aylanib🚶🏽‍♂️": "Dizayn",
        "Lego va shunga o’xshash konstruksiyali o’yinlar o’ynab🤹🏻": "Frontend",
        "Hammasi to’gri✔️": "Fullstack"
    },
    "Farzandingiz yoqtirgan o’yin turi:👫": {
        "Puzzle": "Dizayn",
        "Lego": "Frontend",
        "Mozaika": "Backend",
        "Barchasi to’g’ri✔️": "Fullstack"
    },
    "Farzandingizni xursand qiluvchi 2 ta narsa🤩": {
        "Kompyuter va telefonda o’yinlar va ilovalar🧑🏼‍💻": "Backend",
        "Do’stlari davrasida vaqt otkazish va o’yinlar o’ynash👫": "Frontend",
        "Shirin ovqat va multfilm🍝": "Dizayn",
        "Kitob o’qish, qo’shimcha to’garaklarga borish📕": "Fullstack"
    },
    "Agarda farzandingiz birinchi urinishda biror vazifani uddalay olmasa, qanday yo’l tutadi?": {
        "Qayta qayta urinib ko’radi, vazifani bajarmaguncha✔️": "Dizayn",
        "Tezda qo’li soviydi va boshqa vazifalarga o’tadi🚶🏽‍♂️": "Backend",
        "Boshqalardan yordam so’raydi va ularning yordami evaziga vaziyatdan chiqadi💁🏻‍♂️": "Frontend"
},
"Farzandingiz kompyuter ishlata olish darajasi:💻": {
"Faqatgina o’zi mustaqil yoqib o’chiradi, ilovalarga kirolmaydi": "Dizayn",
"Internetga kiradi, o’ziga kerakli narsani qidira oladi, video ko’radi": "Frontend",
"O’yinlar o’ynaydi, ijtimoiy tarmoqlardan foydalana oladi, fayllar yarata oladi": "Backend",
"Umuman ishlatmagan✔️": "Fullstack"
},
"Farzandingizni eng yaxshi 3 ta xususiyati🤗": {
"Ijodkorlik, yangilik yaratish, kuchli tasavvur📝": "Dizayn",
"Sabrlilik, barcha vazifaga yurakdan yondashish, mustaqillik🙎🏻‍♂️": "Frontend",
"Liderlik qobiliyati, punktuallik, ma’suliyat🧑🏻‍🏫": "Backend"
}
}


test_ru = {
    "Что ваш ребенок предпочитает делать в свободное время?": {
        "Рисовать или заниматься дизайном": "Design",
        "Играть в компьютерные игры": "Frontend",
        "Разбираться, как устроены приложения и игры": "Backend",
        "Любит все вышеперечисленное": "Fullstack"
    },
    "Как ваш ребенок решает задачи?": {
        "Предпочитает творческие подходы": "Design",
        "Структурировано, пошагово": "Backend",
        "С интересом к визуальной стороне решения": "Frontend",
        "Универсально, с интересом ко всем аспектам": "Fullstack"
    },
    "Какой предмет в школе нравится вашему ребенку больше всего?": {
        "Искусство": "Design",
        "Математика": "Backend",
        "Информатика": "Frontend/Fullstack",
        "Все вышеперечисленные": "Fullstack"
    },
    "Что больше всего привлекает вашего ребенка в компьютерных играх?": {
        "Визуальная составляющая и графика": "Design",
        "Механика игры и ее функциональность": "Backend",
        "Интерактивность и элементы управления": "Frontend",
        "Все аспекты игры": "Fullstack"
    },
    "Какой тип задач больше всего нравится вашему ребенку?": {
        "Создавать красивые презентации и коллажи": "Design",
        "Решать математические головоломки": "Backend",
        "Создавать что-то, с чем можно взаимодействовать": "Frontend",
        "Интересно всё вышеуказанное": "Fullstack"
    },
    "К чему ваш ребенок проявляет больший интерес?": {
        "Книги по искусству и дизайну": "Design",
        "Инструкции и технические справочники": "Backend",
        "Журналы о компьютерных играх и приложениях": "Frontend",
        "Всё вышеперечисленное": "Fullstack"
    },
    "Как ваш ребенок предпочитает работать над проектами/задачами?": {
        "В одиночку, фокусируясь на креативной части": "Design",
        "В команде, обсуждая логику и функционал": "Backend",
        "Самостоятельно, реализуя визуальную составляющую": "Frontend",
        "В любой роли, комбинируя разные подходы": "Fullstack"
    },
    "Как ваш ребенок реагирует на новые задачи?": {
        "Ищет вдохновение в окружающем мире": "Design",
        "Сразу пытается разобраться в деталях": "Backend",
        "Экспериментирует с разными подходами": "Frontend",
        "Исследует все возможные аспекты": "Fullstack"
    },
    "Как ваш ребенок решает проблемы?": {
        "Через творческий подход": "Design",
        "Логическими и аналитическими методами": "Backend",
        "С помощью визуализации и прототипирования": "Frontend",
        "Использует все доступные методы": "Fullstack"
    },
    "Что больше всего мотивирует вашего ребенка учиться?": {
        "Возможность выразить себя": "Design",
        "Желание понять, как всё работает": "Backend",
        "Страсть к технологиям и новинкам": "Frontend",
        "Желание создавать и разрабатывать новое": "Fullstack"
    },
    "Как ваш ребенок предпочитает учиться новому?": {
        "Через визуальные примеры и дизайн": "Design",
        "Через разбор кода и алгоритмов": "Backend",
        "Через создание интерфейсов и эксперименты": "Frontend",
        "Через комплексные проекты, сочетающие всё вышеуказанное": "Fullstack"
    },
    "Какую книгу ваш ребенок выберет в библиотеке?": {
        "Альбом современных художников и дизайнеров": "Design",
        "Справочник по программированию или криптографии": "Backend",
        "Руководство по созданию сайтов и приложений": "Frontend",
        "Книгу о стартапах и разработке программного обеспечения": "Fullstack"
    },
    "Какой YouTube-канал ваш ребенок выберет для просмотра?": {
        "Каналы о графическом дизайне и искусстве": "Design",
        "Обучающие каналы по программированию и IT-технологиям": "Backend",
        "Видеоуроки по созданию сайтов и интерфейсов": "Frontend",
        "Каналы об инновациях в технологиях и разработке": "Fullstack"
    },
    "Как ваш ребенок относится к учебе в целом?": {
        "Предпочитает учебу через творчество и дизайн": "Design",
        "Любит разбираться в сложных вопросах и задачах": "Backend",
        "Интересуется технологиями и новыми инструментами": "Frontend",
        "Нравится узнавать что-то новое в разных областях": "Fullstack"
    },
    "Как ваш ребенок предпочитает проводить время с друзьями?": {
        "Воображаемые игры, где можно что-то создавать": "Design/Fullstack",
        "Игры с правилами, где нужно что-то вычислять или стратегировать": "Backend",
        "Игры на компьютере или консоли": "Frontend/Fullstack"
    },
    "Как ваш ребенок реагирует на новую игрушку или игру?": {
        "Исследует, как это выглядит и что это может делать": "Design",
        "Пытается понять, как это работает": "Backend",
        "Сразу начинает играть, исследуя возможности": "Frontend/Fullstack"
    },
    "Как ваш ребенок рассказывает о своем дне?": {
        "С акцентом на интересные или красивые моменты": "Design",
        "С акцентом на новые факты и открытия": "Backend",
        "Рассказывает разнообразно, сочетая и то, и другое": "Frontend/Fullstack"
    },
    "Что ваш ребенок выберет для подарка на день рождения?": {
        "Набор для творчества или рисования": "Design",
        "Научный набор или головоломки": "Backend",
        "Игровую консоль или компьютерную игру": "Frontend/Fullstack"
    }
}
